#pragma once

#include <ntifs.h>

/********************************************************************************************************************
 * @brief   自定义属性信息回调函数类型：
 *			当应用层通过ExQueryAttributeInformation等API时，如果该属性已注册回调，系统将调用此函数；
 * @param   与查询请求相关的句柄；
 * @param   查询请求的附加参数；
 * @return  NTSTATUS类型的状态码，表示驱动是否加载成功；
********************************************************************************************************************/
typedef NTSTATUS(*MyAttributeInofrmationCallback)(HANDLE handle, PVOID arg);

/********************************************************************************************************************
 * @brief   注册自定义属性信息回调函数；
 *			此函数通过调用 ExRegisterAttributeInformationCallback 注册自定义回调，
 *			用于处理特定属性类（如AttributeMyCustomType）的属性信息查询；
********************************************************************************************************************/
NTSTATUS RegisterCallBack();